app/controllers/api/v1/blocks_controller.rb

SELECT "blocks".* FROM "blocks"
---
  def index
    render json: Block.all