app/controllers/api/v1/levels_controller.rb

  def index
    render json: Level.all
---
SELECT "levels".* FROM "levels"

  def show
    render json: Level.find(params[:id])
---
SELECT  "levels".* FROM "levels" WHERE "levels"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    l = Level.create(level_params)
---
INSERT INTO "levels" ("name", "startPositionX", "startPositionY", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "cxasaas"], ["startPositionX", 30], ["startPositionY", 549], ["created_at", "2019-04-16 13:56:06.985400"], ["updated_at", "2019-04-16 13:56:06.985400"]]