app/controllers/api/v1/scores_controller.rb

INSERT INTO "scores" ("level_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["level_id", 5], ["value", 10], ["created_at", "2019-04-16 14:29:31.344222"], ["updated_at", "2019-04-16 14:29:31.344222"]]
---
  def create
    render json: Score.create(score_params)